In [270]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

import matplotlib as mpl
import matplotlib.font_manager as fm

mpl.rcParams['axes.unicode_minus'] = False

path = 'C:/Windows/Fonts/malgun.ttf'
font_name = fm.FontProperties(fname=path, size=50).get_name()
plt.rc('font', family=font_name)

In [9]:
df = pd.DataFrame(np.random.randn(5,5), index=['a','b','c','d','e'], \
             columns=['one','two','three','four','five'])
df

        one       two     three      four      five
a  0.322317 -0.545209  0.692071  0.449699 -0.162489
b  1.379451  0.500537  2.343961 -0.667965 -0.483025
c -1.325328  1.636878  0.205120 -0.410789  0.925494
d  0.664808 -1.444356 -2.000793  1.372098  0.211418
e -1.428093 -0.215515  0.038214 -0.285105  1.082211

In [10]:
df.iloc[1:3, 1] = np.nan
df.iloc[2, 3:5] = np.nan

In [11]:
# null값 합
df.isna()

     one    two  three   four   five
a  False  False  False  False  False
b  False   True  False  False  False
c  False   True  False   True   True
d  False  False  False  False  False
e  False  False  False  False  False

In [12]:
# nan값이 잇는 row를 삭제
df.dropna()

        one       two     three      four      five
a  0.322317 -0.545209  0.692071  0.449699 -0.162489
d  0.664808 -1.444356 -2.000793  1.372098  0.211418
e -1.428093 -0.215515  0.038214 -0.285105  1.082211

In [13]:
# nan이 있는 column을 지우고 싶음
df.dropna(axis=1)

        one     three
a  0.322317  0.692071
b  1.379451  2.343961
c -1.325328  0.205120
d  0.664808 -2.000793
e -1.428093  0.038214

In [15]:
# 전체 데이터가 nan인 경우만 삭제
df.dropna(how='all')

        one       two     three      four      five
a  0.322317 -0.545209  0.692071  0.449699 -0.162489
b  1.379451       NaN  2.343961 -0.667965 -0.483025
c -1.325328       NaN  0.205120       NaN       NaN
d  0.664808 -1.444356 -2.000793  1.372098  0.211418
e -1.428093 -0.215515  0.038214 -0.285105  1.082211

In [17]:
# non을 가진 row의 데이터가 3개 이상만 삭제해
df.dropna(thresh=3)

        one       two     three      four      five
a  0.322317 -0.545209  0.692071  0.449699 -0.162489
b  1.379451       NaN  2.343961 -0.667965 -0.483025
d  0.664808 -1.444356 -2.000793  1.372098  0.211418
e -1.428093 -0.215515  0.038214 -0.285105  1.082211

In [18]:
# non 값을 0으로 채우기
df.fillna(0)

        one       two     three      four      five
a  0.322317 -0.545209  0.692071  0.449699 -0.162489
b  1.379451  0.000000  2.343961 -0.667965 -0.483025
c -1.325328  0.000000  0.205120  0.000000  0.000000
d  0.664808 -1.444356 -2.000793  1.372098  0.211418
e -1.428093 -0.215515  0.038214 -0.285105  1.082211

In [21]:
# 앞에있는 값으로 non값을 채우라
df.fillna(method = 'ffill')

        one       two     three      four      five
a  0.322317 -0.545209  0.692071  0.449699 -0.162489
b  1.379451 -0.545209  2.343961 -0.667965 -0.483025
c -1.325328 -0.545209  0.205120 -0.667965 -0.483025
d  0.664808 -1.444356 -2.000793  1.372098  0.211418
e -1.428093 -0.215515  0.038214 -0.285105  1.082211

In [22]:
# 뒤에있는 값으로 non값을 채우라
df.fillna(method = 'bfill')

        one       two     three      four      five
a  0.322317 -0.545209  0.692071  0.449699 -0.162489
b  1.379451 -1.444356  2.343961 -0.667965 -0.483025
c -1.325328 -1.444356  0.205120  1.372098  0.211418
d  0.664808 -1.444356 -2.000793  1.372098  0.211418
e -1.428093 -0.215515  0.038214 -0.285105  1.082211

In [24]:
# column 평균값으로 채우기??????row??
df.fillna(df.mean())

        one       two     three      four      five
a  0.322317 -0.545209  0.692071  0.449699 -0.162489
b  1.379451 -0.735027  2.343961 -0.667965 -0.483025
c -1.325328 -0.735027  0.205120  0.217182  0.162029
d  0.664808 -1.444356 -2.000793  1.372098  0.211418
e -1.428093 -0.215515  0.038214 -0.285105  1.082211

In [25]:
# ????? 평균채우기라는데 뭔 평균이라는지

data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'Giant', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

df = pd.DataFrame(data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Giant     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [29]:
# 팀별로 포인트의 평균값??????????
df.groupby('Team')['Points'].mean()

Team
Devils    768.000000
Giant     812.000000
Kings     761.666667
Riders    762.250000
Royals    752.500000
Name: Points, dtype: float64

In [37]:
# Team별로 가장 좋은 ranking을 뽑는다
df.groupby('Team')['Rank'].min()

Team
Devils    2
Giant     4
Kings     1
Riders    1
Royals    1
Name: Rank, dtype: int64

In [38]:
#  연도별 최고 점수는
df.groupby('Year')['Points'].max()

Year
2014    876
2015    812
2016    756
2017    788
Name: Points, dtype: int64

In [42]:
# 팀별 데이터 각각 몇개 인가?
df.groupby('Team')['Points'].count()

Team
Devils    2
Giant     1
Kings     3
Riders    4
Royals    2
Name: Points, dtype: int64

In [44]:
# 팀별, 연도별 포인트 최고점은?
df.groupby(['Team','Year'])['Points'].max()

Team    Year
Devils  2014    863
        2015    673
Giant   2015    812
Kings   2014    741
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
Name: Points, dtype: int64

In [56]:
tt = pd.read_csv('./data/phone_data.csv', index_col=0)    # index_col=0 인덱스 바꾸기(이중 인덱스에서 하나로)
tt.head()

                 date  duration  item    month   network network_type
index
0      15/10/14 06:58    34.429  data  2014-11      data         data
1      15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

In [48]:
#  월별 통신 이용시간의 합을 계산
tt.groupby('month')['duration'].sum()

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [49]:
#  월별 통화 시간의 합
tt.groupby('month')['duration'].sum()

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [50]:
# 아이템별 이용시간 합
tt.groupby('item')['duration'].sum()

item
call    92321.00
data     5164.35
sms       292.00
Name: duration, dtype: float64

In [51]:
#  월별 아이템별 이용건수
tt.groupby('month')['duration'].count()

month
2014-11    230
2014-12    157
2015-01    205
2015-02    137
2015-03    101
Name: duration, dtype: int64

In [60]:
# 테이블 형식  하나의 인덱스를  column으로 뺌
tt['date'] = pd.to_datetime(tt['date'])
tt.info()
tt.groupby(['month','item'])['duration'].count().unstack()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 830 entries, 0 to 829
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          830 non-null    datetime64[ns]
 1   duration      830 non-null    float64
 2   item          830 non-null    object
 3   month         830 non-null    object
 4   network       830 non-null    object
 5   network_type  830 non-null    object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 45.4+ KB

item     call  data  sms
month
2014-11   107    29   94
2014-12    79    30   48
2015-01    88    31   86
2015-02    67    31   39
2015-03    47    29   25

In [61]:
d = {'a':[10,20,30],'b':[20,30,40],'c':[50,60,70]}
dd = pd.DataFrame(d)
dd

    a   b   c
0  10  20  50
1  20  30  60
2  30  40  70

In [64]:
# 값에 2씩 곱해주기
dd['a'].apply(lambda x:x**2)

0    100
1    400
2    900
Name: a, dtype: int64

In [65]:
dd = pd.read_csv('./data/phone_data.csv', index_col=0)
dd

                 date  duration  item    month   network network_type
index
0      15/10/14 06:58    34.429  data  2014-11      data         data
1      15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      15/10/14 17:27     4.000  call  2014-11     Tesco       mobile
...               ...       ...   ...      ...       ...          ...
825    13/03/15 00:38     1.000   sms  2015-03     world        world
826    13/03/15 00:39     1.000   sms  2015-03  Vodafone       mobile
827    13/03/15 06:58    34.429  data  2015-03      data         data
828    14/03/15 00:13     1.000   sms  2015-03     world        world
829    14/03/15 00:16     1.000   sms  2015-03     world        world

[830 rows x 6 columns]

In [87]:
dd['month']= pd.to_datetime(dd['month'])

In [90]:
# 연도만 뽑고 싶을때

dd['month'].dt.year
# dd['date'] = dd.to_datetime(dd['date'], format='%Y/%m/%d %H:%M')

index
0      2014
1      2014
2      2014
3      2014
4      2014
       ...
825    2015
826    2015
827    2015
828    2015
829    2015
Name: month, Length: 830, dtype: int64

In [91]:
# duration 소숫점 첫째자리 반올림
dd['duration'].round(1)

index
0      34.4
1      13.0
2      23.0
3       4.0
4       4.0
       ...
825     1.0
826     1.0
827    34.4
828     1.0
829     1.0
Name: duration, Length: 830, dtype: float64

In [96]:
# duration을 정수로 바꾸기_
dd['duration'].apply(lambda x:int(x))

index
0      34
1      13
2      23
3       4
4       4
       ..
825     1
826     1
827    34
828     1
829     1
Name: duration, Length: 830, dtype: int64

In [101]:
ff = pd.read_csv('./data/EcommercePurchases')
ff = pd.DataFrame(ff)
ff.head()

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\r\nAlexisborough, NE ...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\r\nSouth John, TN...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\r\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\r\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\r\nNew Cynthia, TX...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [119]:
# 도메인 뽑기
ff['email_domain'] = ff['Email'].apply(lambda x:x.split('@')[1])
ff.head()

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price,email_domain
0,"16629 Pace Camp Apt. 448\r\nAlexisborough, NE ...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14,yahoo.com
1,"9374 Jasmine Spurs Suite 508\r\nSouth John, TN...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73,reed.com
2,Unit 0065 Box 5052\r\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95,morales-harrison.com
3,"7780 Julia Fords\r\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04,olson-robinson.info
4,"23012 Munoz Drive Suite 337\r\nNew Cynthia, TX...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82,gmail.com

In [121]:
# value_counts()
ff['Email'].apply(lambda x:x.split('@')[1]).value_counts()

hotmail.com            1638
yahoo.com              1616
gmail.com              1605
smith.com                42
williams.com             37
                       ...
booker.com                1
woods-allen.biz           1
richards-wilson.com       1
morris-thomas.com         1
wade-garner.com           1
Name: Email, Length: 3416, dtype: int64

In [124]:
#  오전 구매건수와 오후 구매 건수를 계산하시오
ff['AM or PM'].value_counts()

PM    5068
AM    4932
Name: AM or PM, dtype: int64

In [128]:
#  고객들이 사용하는 브라우저 종류별 갯수를 출력하시오
ff['browse'] = ff['Browser Info'].apply(lambda x:x.split('/')[0])
ff['browse'].value_counts()

Mozilla    7924
Opera      2076
Name: browse, dtype: int64

In [131]:
raw_data = {
    'subject_id': ['1','2','3','4','5','7','8','9','10','11'],
    'test_score': [51,13,16,71,63,74,90,88,87,99]
    
}
df_a = pd.DataFrame(raw_data)
df_a.head(1)

  subject_id  test_score
0          1          51

In [132]:
raw_data = {
    'subject_id' : ['4','5','6','7','8'],
    'first_name' : ['Billy','Brian','Bran','Bryce','Betty'],
    'last_name' : ['Bonder','Black','Balwner','Brice','Btisan']
    
}
df_b = pd.DataFrame(raw_data)
df_b.head(1)

  subject_id first_name last_name
0          4      Billy    Bonder

In [133]:
# 비어있는 내용은 nan표시
df_a

  subject_id  test_score
0          1          51
1          2          13
2          3          16
3          4          71
4          5          63
5          7          74
6          8          90
7          9          88
8         10          87
9         11          99

In [ ]:
ff = pd.read_csv('./data/EcommercePurchases')

per = pd.read_csv('./data/survey_person.csv')
site = pd.read_csv('./data/survey_site.csv')
survey = pd.read_csv('./data/survey_survey.csv')
visited = pd.read_csv('./data/survey_visited.csv')

In [ ]:
# Salaries1,csv 파일을 dataframe으로 읽으시오
d = pd.read_csv('./data/Salaries.csv')
dd = pd.DataFrame(d)
d.head()

In [136]:
d.head(1)

,Unnamed: 0,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [138]:
# BasePay의 평균은 얼마인가?
dd['BasePay'].mean()

75601.13714620461

In [139]:
# OverTimepay의 최대값은?
dd['OvertimePay'].max()

245131.88

In [148]:
# 'JOSEPH DRISCOLL' 의 JOB TITLE은?
dd[dd['EmployeeName']=='JOSEPH DRISCOLL'],'JobTitle'

(    Unnamed: 0  Id     EmployeeName                   JobTitle    BasePay  \
 24          24  25  JOSEPH DRISCOLL  CAPTAIN, FIRE SUPPRESSION  140546.86

     OvertimePay  OtherPay  Benefits   TotalPay  TotalPayBenefits  Year  Notes  \
 24     97868.77  31909.28       NaN  270324.91         270324.91  2011    NaN

            Agency  Status
 24  San Francisco     NaN  ,
 'JobTitle')

In [153]:
# TotalPayBeneift의 최고금액을 수령하는 사람의 이름은?
dd.groupby('EmployeeName')['TotalPayBenefits'].max()

EmployeeName
A BERNARD FATOOH          20039.91
A ELIZABETH MARCHASIN     26282.86
A JAMIL NIAZI             87496.21
A. JAMES ROBERTSON II     19473.92
AARIC PINGREE             36883.91
                           ...
Zoe Polk                 141787.85
Zoila Lechuga            140675.23
Zoila Maguina            167054.63
Zula Jones               163422.67
Zuri Jones               122350.86
Name: TotalPayBenefits, Length: 47466, dtype: float64

In [154]:
# BasePay의 연도별 평균금액은?
dd.groupby('Year')['BasePay'].mean()

Year
2011     63595.956517
2012    106964.140280
Name: BasePay, dtype: float64

In [163]:
# JobTitle에서 가장 많은 Job 상위 5개?
dd['JobTitle'].value_counts().head(5)

TRANSIT OPERATOR    2388
SPECIAL NURSE       1402
REGISTERED NURSE    1219
Registered Nurse    1003
CUSTODIAN            796
Name: JobTitle, dtype: int64

In [175]:
# 2011년도에 오직 한 사람만이 수행하는 job의 갯수는?
sum(dd[dd['Year']==2011]['JobTitle'].value_counts()==1)

200

In [186]:
# 'Chief'라는 직업을 가진 사람의 수
sum(dd['JobTitle'].apply(lambda x:'chief' in x.lower()))

318

In [195]:
# seoul_weather.csv 불러오기
s = pd.read_csv('./data/seoul_weather.csv', encoding='cp949', skiprows=11)
ss = pd.DataFrame(s)

In [196]:
ss.head()

   \t\t지점번호 지점명          일시  평균기온(℃)  최고기온(℃) \t최고기온시각  최저기온(℃) 최저기온시각
0       108  서울  1907-10-01     13.5     20.7      NaN      7.9    NaN
1       108  서울  1907-10-02     16.2     22.0      NaN      7.9    NaN
2       108  서울  1907-10-03     16.2     21.3      NaN     13.1    NaN
3       108  서울  1907-10-04     16.5     22.0      NaN     11.2    NaN
4       108  서울  1907-10-05     17.6     25.4      NaN     10.9    NaN

In [200]:
ss.drop(['\t최고기온시각','최저기온시각'], axis=1, inplace=True)
ss.head()

   \t\t지점번호 지점명          일시  평균기온(℃)  최고기온(℃)  최저기온(℃)
0       108  서울  1907-10-01     13.5     20.7      7.9
1       108  서울  1907-10-02     16.2     22.0      7.9
2       108  서울  1907-10-03     16.2     21.3     13.1
3       108  서울  1907-10-04     16.5     22.0     11.2
4       108  서울  1907-10-05     17.6     25.4     10.9

In [202]:
ss.columns = '지점번호','지점명','일시','평온','최고기온','최저기온'
ss.head(3)

   지점번호 지점명          일시    평온  최고기온  최저기온
0   108  서울  1907-10-01  13.5  20.7   7.9
1   108  서울  1907-10-02  16.2  22.0   7.9
2   108  서울  1907-10-03  16.2  21.3  13.1

In [224]:
# 역대 최고기온인 날의 날짜는?
ss.sort_values(by='최고기온', ascending=False)['일시'].head(1).values

array(['2018-08-01'], dtype=object)

In [258]:
# 일교차가 가장 큰 월은 언제인가?
ss['일시'] = pd.to_datetime(ss['일시'])
ss['월'] = ss['일시'].dt.month

In [237]:
ss.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40488 entries, 0 to 40487
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   지점번호    40488 non-null  int64
 1   지점명     40488 non-null  object
 2   일시      40488 non-null  datetime64[ns]
 3   평온      39732 non-null  float64
 4   최고기온    39730 non-null  float64
 5   최저기온    39731 non-null  float64
 6   월       40488 non-null  int64
dtypes: datetime64[ns](1), float64(3), int64(2), object(1)
memory usage: 2.2+ MB

In [245]:
li=[]
suba = 0.0
for i in ss.index:
    suba = ss['최고기온'][i] - ss['최저기온'][i]
    li.append(suba)
    
ss['일교차'] = li

In [255]:
ss.sort_values('일교차', ascending=False).iloc[:1]

       지점번호 지점명         일시    평온  최고기온  최저기온  월   일교차
12619   108  서울 1942-04-19  12.7  24.3   2.5  4  21.8

In [ ]:
# 월교차가 가장 큰 연도는?

In [260]:
ss['연도'] = ss['일시'].dt.year

In [261]:
ss.head(3)

   지점번호 지점명         일시    평온  최고기온  최저기온   월   일교차    연도
0   108  서울 1907-10-01  13.5  20.7   7.9  10  12.8  1907
1   108  서울 1907-10-02  16.2  22.0   7.9  10  14.1  1907
2   108  서울 1907-10-03  16.2  21.3  13.1  10   8.2  1907

In [268]:
ss.groupby(['연도','월'])['평온'].mean().unstack().std(axis=1).sort_values(ascending=False).head(1)

연도
1917    12.088418
dtype: float64

In [275]:
s = pd.read_csv('./data/seoul_weather.csv', encoding='cp949', skiprows=11)
ss = pd.DataFrame(s)

In [273]:
t = pd.read_csv('./data/seoul_weather.cvs', encoding='cp949', skiprows=11)
ts = pd.DataFrame(t)
ts

FileNotFoundError: [Errno 2] No such file or directory: './data/seoul_weather.cvs'

In [ ]:
# 8월의 최고기온을 추출해서 라인그래프로 그리시오
# 매년 8월 중에 최고기온 하나를 뽑아서 라인 차트로 그리시오 
# 지구온난화 여부확인을 위해 매년 평균기온의 line차트를 그리시오 
# 1~12월 사이 각 월의 일평균기온의 bax chart를 그리시오